notes/org/java.org
#+TITLE: Java
#+SETUPFILE: ../setup.org

* Installation

  Best resource I've found is [[https://mkyong.com/java/how-to-install-java-on-mac-osx/][How to install Java JDK on macOS]].

** Latest

  #+begin_src sh
    brew install java
  #+end_src

  #+begin_src sh
    sudo ln -svfn \
         $(brew --prefix)/opt/openjdk/libexec/openjdk.jdk \
         /Library/Java/JavaVirtualMachines/openjdk.jdk
  #+end_src

** Older java versions

   Older java packages may not work on Apple Silicon.

  #+begin_src sh
    brew install openjdk@17
  #+end_src

  #+begin_src sh
    sudo ln -svfn \
         $(brew --prefix)/opt/openjdk@17/libexec/openjdk.jdk \
         /Library/Java/JavaVirtualMachines/openjdk-17.jdk
  #+end_src

* Switch Versions

  To see installed Java versions (assuming they have been properly symlinked):

  #+begin_src sh
    /usr/libexec/java_home -V
  #+end_src

  You can set =JAVA_HOME= to be one of those paths like this:

  #+begin_src bash
    export JAVA_HOME=$(/usr/libexec/java_home -v 1.8)
  #+end_src

* GraalVM

  Installation

  #+name: q
  #+begin_example
    query {
      repository(name: "graalvm-ce-builds", owner: "graalvm") {
        releases(orderBy: {field: CREATED_AT, direction: ASC}, last: 1) {
          nodes {
            name
            releaseAssets(first: 100) {
              nodes {
                name
                downloadUrl
              }
            }
          }
        }
      }
    }
  #+end_example

  #+header: :backend babashka
  #+header: :var q=q
  #+begin_src clojure :results output
    (require '[babashka.curl :as curl])

    (def token (System/getenv "GITHUB_TOKEN"))

    (def resp
      (curl/post
       "https://api.github.com/graphql"
       {:headers {"Authorization"
                  (str "bearer " token)}
        :body (json/generate-string {:query q})}))

    (def names-and-urls
      (-> resp
         :body
         (json/parse-string true)
         (get-in [:data :repository :releases :nodes])
         first ;; todo: map
         (get-in [:releaseAssets :nodes])))

    ;; Can there be multiple release assets with the same name?
    (def my-items
      (filter ;; should this be a reduce?
       #(=
         "graalvm-ce-java17-darwin-amd64-22.1.0.tar.gz"
         (:name %))
       names-and-urls))

    (-> my-item
        first
        :downloadUrl)
  #+end_src

  #+RESULTS:



foo

  : "https://github.com/graalvm/graalvm-ce-builds/releases/download/vm-22.1.0/graalvm-ce-java17-darwin-amd64-22.1.0.tar.gz"
